Revit 2026 API

# FailureDefinitionSetDefaultResolutionType Method

---

Sets the default resolution type for the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureDefinition SetDefaultResolutionType(
	FailureResolutionType type
)
```
```vb
Public Function SetDefaultResolutionType (
	type As FailureResolutionType
) As FailureDefinition
```
```cpp
public:
FailureDefinition^ SetDefaultResolutionType(
	FailureResolutionType type
)
```
```fsharp
member SetDefaultResolutionType :
        type : FailureResolutionType -> FailureDefinition
```

#### Parameters

type FailureResolutionType
     The type of resolution to be used as default.

#### Return Value

FailureDefinition The FailureDefinition.

| Exception | Condition |
| --- | --- |
| ArgumentException | Resolution of the type is not applicable to the failure. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | FailureDefinition does not have any resolutions. |

If failure has multiple resolutions, one of them is designated as designated as the default resolution. The default resolution is used by Revit failure processing mechanism to resolve failures automatically when applicable.

#### Reference

FailureDefinition Class

Autodesk.Revit.DB Namespace